@extends('web.layouts.app')
@section('contact')
    <!---------------------hero section--------------------------->

    <section class="hero-section d-flex align-items-center" id="particles-js">
        <div class="container">
            <div class="row align-items-center">
                <div class="col-12 col-lg-6 hero-content mb-5" data-aos="fade-left" data-aos-duration="1000"
                    data-aos-easing="ease-in-out">
                    <span class="text-success fw-bold">{{ __('Start Bidding') }}</span>
                    <h1 class="fw-bold mt-2">{{ __('Get the car of your dreams today') }}</h1>
                    <p class="text-muted">
                        {{ __('Welcome to the best car bidding platform. Discover a wide range of cars, bid at the right time, and enjoy the experience of winning your perfect car. All with the motto: "Don\'t miss the opportunity to own your new car in style."') }}
                    </p>
                    <div class="hero-btns-container d-flex gap-2">
                        <a href="{{ route('web.autions') }}" class="btn btn-primary hero-btn">{{ __('Start Now') }}</a>
                        <a href="{{ route('web.feddback.create') }}" class="btn border-primary hero-btn hero-contact">{{ __('Feedback') }}</a>
                    </div>
                </div>
                <div class="col-12 col-lg-6" data-aos="fade-right" data-aos-duration="1000" data-aos-easing="ease-in-out">
                    <img src="{{ asset('web/assets/Images/car-bg.png') }}" alt="Car Image" class="img-fluid">
                </div>
            </div>
        </div>
    </section>





    <!---------------------latest auctions --------------------------->
    <section class="latest-auctions elmazad-page my-4">
        <h1 class="main-heading text-center fs-3 fw-bold">
            {{ __('Latest Auctions') }}
        </h1>
        <p class="text-center main-para">
            {{ __('Discover our latest exclusive auctions, where a distinguished collection of cars is available to suit all tastes and budgets.') }}
        </p>

        <div class="container">
            <div class="row my-5 py-2 justify-content-center ">
                {{-- <div class="col-md-6 col-xl-3 mb-4" data-aos="fade-left" data-aos-duration="1500">
                <div class="card">
                    <div class="mazad-user-info d-flex flex-wrap align-items-center justify-content-between mb-4">
                        <div class="user-img d-flex align-items-center gap-2 mb-3 flex-wrap">
                            <img src="{{ asset('web/assets/Images/user.png')}}" alt="user img" />
                            <div class="user-info">
                                <h6 class="fw-bold">حسن ابو النصر</h6>
                                <a>مشاهده الملف </a>
                            </div>
                        </div>
                        <span><svg xmlns="http://www.w3.org/2000/svg" width="17" height="16" viewBox="0 0 17 16"
                                fill="none">
                                <path
                                    d="M15.9999 7.99996C15.9999 12.05 12.7167 15.3333 8.66659 15.3333C4.6165 15.3333 1.33325 12.05 1.33325 7.99996C1.33325 3.94987 4.6165 0.666626 8.66659 0.666626C12.7167 0.666626 15.9999 3.94987 15.9999 7.99996ZM2.67114 7.99996C2.67114 11.3112 5.35539 13.9954 8.66659 13.9954C11.9778 13.9954 14.6621 11.3112 14.6621 7.99996C14.6621 4.68877 11.9778 2.00451 8.66659 2.00451C5.35539 2.00451 2.67114 4.68877 2.67114 7.99996Z"
                                    fill="#606060" />
                                <path
                                    d="M8.66642 3.33337C8.29822 3.33337 7.99976 3.63185 7.99976 4.00004V8.31117C7.99976 8.31117 7.99976 8.48497 8.08422 8.61571C8.14076 8.72657 8.22889 8.82291 8.34469 8.88977L11.4246 10.668C11.7434 10.852 12.1512 10.7428 12.3352 10.4239C12.5193 10.105 12.4101 9.69731 12.0912 9.51324L9.33309 7.92084V4.00004C9.33309 3.63185 9.03462 3.33337 8.66642 3.33337Z"
                                    fill="#606060" />
                            </svg> منذ 15 د</span>
                    </div>
                    <div id="carousel10" class="carousel slide" data-bs-ride="carousel">
                        <div class="carousel-indicators">
                            <button type="button" data-bs-target="#carousel4" data-bs-slide-to="0"
                                class="active"></button>
                            <button type="button" data-bs-target="#carousel4" data-bs-slide-to="1"></button>
                            <button type="button" data-bs-target="#carousel4" data-bs-slide-to="2"></button>
                        </div>
                        <div class="carousel-inner">
                            <div class="carousel-item active">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                            <div class="carousel-item">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                            <div class="carousel-item">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                        </div>
                        <button class="carousel-control-prev" type="button" data-bs-target="#carousel10"
                            data-bs-slide="prev">
                            <span class="carousel-control-prev-icon"></span>
                        </button>
                        <button class="carousel-control-next" type="button" data-bs-target="#carousel10"
                            data-bs-slide="next">
                            <span class="carousel-control-next-icon"></span>
                        </button>
                    </div>

                    <!-- Card Body -->
                    <div class="card-body">
                        <div class="car-info d-flex  justify-content-between sidebar-category">
                            <h6 class="card-title">عربية BMW 2024 </h6>
                            <p class="price">2,000,000 جنيه</p>
                        </div>

                        <!-- Auction Details -->
                        <div class="auction-details">
                            <span class="badge d-flex align-items-center gap-2"><svg
                                    xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 16 16"
                                    fill="none">
                                    <path
                                        d="M14.6688 8.96703L10.8028 7.57753L9.18676 5.54853C9.04624 5.37673 8.86924 5.23837 8.66859 5.1435C8.46795 5.04862 8.2487 4.99961 8.02676 5.00003H4.02876C3.78426 5.00003 3.54346 5.0598 3.32734 5.17414C3.11122 5.28847 2.92633 5.4539 2.78876 5.65603L1.43276 7.64753C1.15067 8.06216 0.999804 8.55204 0.999756 9.05353V13C0.999756 13.1326 1.05243 13.2598 1.1462 13.3536C1.23997 13.4473 1.36715 13.5 1.49976 13.5H2.57076C2.67952 13.9291 2.92827 14.3097 3.27764 14.5816C3.62702 14.8535 4.05707 15.0011 4.49976 15.0011C4.94244 15.0011 5.37249 14.8535 5.72187 14.5816C6.07124 14.3097 6.31999 13.9291 6.42876 13.5H9.57076C9.67952 13.9291 9.92827 14.3097 10.2776 14.5816C10.627 14.8535 11.0571 15.0011 11.4998 15.0011C11.9424 15.0011 12.3725 14.8535 12.7219 14.5816C13.0712 14.3097 13.32 13.9291 13.4288 13.5H14.4998C14.6324 13.5 14.7595 13.4473 14.8533 13.3536C14.9471 13.2598 14.9998 13.1326 14.9998 13V9.43753C14.9997 9.33456 14.9679 9.23412 14.9087 9.14991C14.8495 9.0657 14.7657 9.00183 14.6688 8.96703ZM4.49976 14C4.30197 14 4.10863 13.9414 3.94419 13.8315C3.77974 13.7216 3.65156 13.5654 3.57588 13.3827C3.50019 13.2 3.48039 12.9989 3.51897 12.8049C3.55756 12.611 3.6528 12.4328 3.79265 12.2929C3.9325 12.1531 4.11068 12.0578 4.30467 12.0192C4.49865 11.9807 4.69971 12.0005 4.88244 12.0761C5.06517 12.1518 5.22134 12.28 5.33123 12.4445C5.44111 12.6089 5.49976 12.8022 5.49976 13C5.49936 13.2651 5.39387 13.5192 5.20642 13.7067C5.01897 13.8941 4.76485 13.9996 4.49976 14ZM11.4998 14C11.302 14 11.1086 13.9414 10.9442 13.8315C10.7797 13.7216 10.6516 13.5654 10.5759 13.3827C10.5002 13.2 10.4804 12.9989 10.519 12.8049C10.5576 12.611 10.6528 12.4328 10.7926 12.2929C10.9325 12.1531 11.1107 12.0578 11.3047 12.0192C11.4986 11.9807 11.6997 12.0005 11.8824 12.0761C12.0652 12.1518 12.2213 12.28 12.3312 12.4445C12.4411 12.6089 12.4998 12.8022 12.4998 13C12.4994 13.2651 12.3939 13.5192 12.2064 13.7067C12.019 13.8941 11.7649 13.9996 11.4998 14ZM13.9998 12.5H13.4288C13.32 12.0709 13.0712 11.6903 12.7219 11.4184C12.3725 11.1466 11.9424 10.999 11.4998 10.999C11.0571 10.999 10.627 11.1466 10.2776 11.4184C9.92827 11.6903 9.67952 12.0709 9.57076 12.5H6.42876C6.31999 12.0709 6.07124 11.6903 5.72187 11.4184C5.37249 11.1466 4.94244 10.999 4.49976 10.999C4.05707 10.999 3.62702 11.1466 3.27764 11.4184C2.92827 11.6903 2.67952 12.0709 2.57076 12.5H1.99976V9.05353C1.99976 8.75248 2.09036 8.45839 2.25976 8.20953L3.61526 6.21903C3.66109 6.15157 3.72273 6.09634 3.79481 6.05817C3.86688 6.02 3.9472 6.00004 4.02876 6.00003H8.02676C8.09951 6.00004 8.17138 6.01593 8.23736 6.04659C8.30334 6.07724 8.36183 6.12193 8.40876 6.17753L10.1088 8.31152C10.1666 8.3841 10.2434 8.43915 10.3308 8.47053L13.9998 9.78903V12.5ZM12.2773 3.00003C12.2773 2.73481 12.3826 2.48046 12.5701 2.29292C12.7577 2.10538 13.012 2.00003 13.2773 2.00003H14.9998C14.8029 1.65639 14.5078 1.37939 14.1524 1.20456C13.7971 1.02972 13.3976 0.965019 13.0052 1.01874C12.6128 1.07246 12.2454 1.24217 11.9501 1.50608C11.6548 1.77 11.445 2.11611 11.3478 2.50003H7.99976V3.50003H11.3478C11.445 3.88394 11.6548 4.23005 11.9501 4.49397C12.2454 4.75789 12.6128 4.92759 13.0052 4.98131C13.3976 5.03503 13.7971 4.97033 14.1524 4.79549C14.5078 4.62066 14.8029 4.34366 14.9998 4.00003H13.2773C13.012 4.00003 12.7577 3.89467 12.5701 3.70713C12.3826 3.5196 12.2773 3.26524 12.2773 3.00003Z"
                                        fill="#386BF6" />
                                </svg> التقرير</span>

                            <span class="badge d-flex align-items-center gap-2"> <i class="fa fa-user"></i>
                                المزايدات <strong>50</strong> </span>
                            <span class="badge d-flex gap-2 align-items-center"> <svg
                                    xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 16 16"
                                    fill="none">
                                    <path
                                        d="M1.33301 12.6667C1.33301 13.8 2.19967 14.6667 3.33301 14.6667H12.6663C13.7997 14.6667 14.6663 13.8 14.6663 12.6667V7.33337H1.33301V12.6667ZM12.6663 2.66671H11.333V2.00004C11.333 1.60004 11.0663 1.33337 10.6663 1.33337C10.2663 1.33337 9.99967 1.60004 9.99967 2.00004V2.66671H5.99967V2.00004C5.99967 1.60004 5.73301 1.33337 5.33301 1.33337C4.93301 1.33337 4.66634 1.60004 4.66634 2.00004V2.66671H3.33301C2.19967 2.66671 1.33301 3.53337 1.33301 4.66671V6.00004H14.6663V4.66671C14.6663 3.53337 13.7997 2.66671 12.6663 2.66671Z"
                                        fill="#9DB2CE" />
                                </svg> الأسبوع 1 </span>
                        </div>


                        <a href="MazadDetails.html" class="btn mazad-btn w-100 mt-3"> <svg
                                xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20"
                                fill="none">
                                <g clip-path="url(#clip0_246_3877)">
                                    <path
                                        d="M8.85376 17.4163H8.42497V16.4343C8.42497 15.8588 7.95849 15.3921 7.38243 15.3921H2.84716C2.27138 15.3921 1.80458 15.8588 1.80458 16.4343V17.4163H1.37583C0.800361 17.4163 0.333252 17.8831 0.333252 18.4592V19.6233H9.8963V18.4592C9.8963 17.8831 9.42985 17.4163 8.85376 17.4163Z"
                                        fill="white" />
                                    <path
                                        d="M19.7456 13.0472L12.2657 8.01344L12.6625 7.42383C12.9734 6.96176 13.0265 6.40203 12.8547 5.91449C13.5059 5.01988 14.0801 5.6673 14.5246 4.82168C14.9803 3.95437 14.4228 3.15902 12.2733 1.71254C10.1238 0.265975 9.17702 0.0489048 8.54561 0.797772C7.94784 1.50613 8.69765 1.79887 8.21046 2.67367C7.63468 2.64262 7.05733 2.90648 6.7121 3.41941L4.34929 6.93062C4.00784 7.43797 3.97737 8.06305 4.21421 8.58133C3.62491 9.20203 3.10476 8.71203 2.69448 9.4923C2.23901 10.3593 2.79628 11.1546 4.94577 12.6011C7.0953 14.0477 8.04206 14.2644 8.67374 13.5159C9.2621 12.8182 8.54433 12.5245 8.98663 11.6805C9.49831 11.6525 9.99147 11.393 10.2996 10.935L10.7803 10.2211L18.2598 15.2548C18.8694 15.6651 19.6962 15.5033 20.1065 14.8939C20.5167 14.2842 20.355 13.4575 19.7456 13.0472Z"
                                        fill="white" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_246_3877">
                                        <rect width="20" height="20" fill="white" transform="translate(0.333252)" />
                                    </clipPath>
                                </defs>
                            </svg> مزايده </a>
                    </div>
                </div>
            </div>
            <div class="col-md-6 col-xl-3 mb-4" data-aos="fade-down" data-aos-duration="1500">
                <div class="card">
                    <div class="mazad-user-info d-flex flex-wrap align-items-center justify-content-between mb-4">
                        <div class="user-img d-flex align-items-center gap-2 mb-3 flex-wrap">
                            <img src="{{ asset('web/assets/Images/user.png')}}" alt="user img" />
                            <div class="user-info">
                                <h6 class="fw-bold">حسن ابو النصر</h6>
                                <a>مشاهده الملف </a>
                            </div>
                        </div>
                        <span><svg xmlns="http://www.w3.org/2000/svg" width="17" height="16" viewBox="0 0 17 16"
                                fill="none">
                                <path
                                    d="M15.9999 7.99996C15.9999 12.05 12.7167 15.3333 8.66659 15.3333C4.6165 15.3333 1.33325 12.05 1.33325 7.99996C1.33325 3.94987 4.6165 0.666626 8.66659 0.666626C12.7167 0.666626 15.9999 3.94987 15.9999 7.99996ZM2.67114 7.99996C2.67114 11.3112 5.35539 13.9954 8.66659 13.9954C11.9778 13.9954 14.6621 11.3112 14.6621 7.99996C14.6621 4.68877 11.9778 2.00451 8.66659 2.00451C5.35539 2.00451 2.67114 4.68877 2.67114 7.99996Z"
                                    fill="#606060" />
                                <path
                                    d="M8.66642 3.33337C8.29822 3.33337 7.99976 3.63185 7.99976 4.00004V8.31117C7.99976 8.31117 7.99976 8.48497 8.08422 8.61571C8.14076 8.72657 8.22889 8.82291 8.34469 8.88977L11.4246 10.668C11.7434 10.852 12.1512 10.7428 12.3352 10.4239C12.5193 10.105 12.4101 9.69731 12.0912 9.51324L9.33309 7.92084V4.00004C9.33309 3.63185 9.03462 3.33337 8.66642 3.33337Z"
                                    fill="#606060" />
                            </svg> منذ 15 د</span>
                    </div>
                    <div id="carousel4" class="carousel slide" data-bs-ride="carousel">
                        <div class="carousel-indicators">
                            <button type="button" data-bs-target="#carousel4" data-bs-slide-to="0"
                                class="active"></button>
                            <button type="button" data-bs-target="#carousel4" data-bs-slide-to="1"></button>
                            <button type="button" data-bs-target="#carousel4" data-bs-slide-to="2"></button>
                        </div>
                        <div class="carousel-inner">
                            <div class="carousel-item active">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                            <div class="carousel-item">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                            <div class="carousel-item">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                        </div>
                        <button class="carousel-control-prev" type="button" data-bs-target="#carousel4"
                            data-bs-slide="prev">
                            <span class="carousel-control-prev-icon"></span>
                        </button>
                        <button class="carousel-control-next" type="button" data-bs-target="#carousel4"
                            data-bs-slide="next">
                            <span class="carousel-control-next-icon"></span>
                        </button>
                    </div>

                    <!-- Card Body -->
                    <div class="card-body">
                        <div class="car-info d-flex  justify-content-between sidebar-category">
                            <h6 class="card-title">عربية BMW 2024 </h6>
                            <p class="price">2,000,000 جنيه</p>
                        </div>

                        <!-- Auction Details -->
                        <div class="auction-details">
                            <span class="badge d-flex align-items-center gap-2"><svg
                                    xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 16 16"
                                    fill="none">
                                    <path
                                        d="M14.6688 8.96703L10.8028 7.57753L9.18676 5.54853C9.04624 5.37673 8.86924 5.23837 8.66859 5.1435C8.46795 5.04862 8.2487 4.99961 8.02676 5.00003H4.02876C3.78426 5.00003 3.54346 5.0598 3.32734 5.17414C3.11122 5.28847 2.92633 5.4539 2.78876 5.65603L1.43276 7.64753C1.15067 8.06216 0.999804 8.55204 0.999756 9.05353V13C0.999756 13.1326 1.05243 13.2598 1.1462 13.3536C1.23997 13.4473 1.36715 13.5 1.49976 13.5H2.57076C2.67952 13.9291 2.92827 14.3097 3.27764 14.5816C3.62702 14.8535 4.05707 15.0011 4.49976 15.0011C4.94244 15.0011 5.37249 14.8535 5.72187 14.5816C6.07124 14.3097 6.31999 13.9291 6.42876 13.5H9.57076C9.67952 13.9291 9.92827 14.3097 10.2776 14.5816C10.627 14.8535 11.0571 15.0011 11.4998 15.0011C11.9424 15.0011 12.3725 14.8535 12.7219 14.5816C13.0712 14.3097 13.32 13.9291 13.4288 13.5H14.4998C14.6324 13.5 14.7595 13.4473 14.8533 13.3536C14.9471 13.2598 14.9998 13.1326 14.9998 13V9.43753C14.9997 9.33456 14.9679 9.23412 14.9087 9.14991C14.8495 9.0657 14.7657 9.00183 14.6688 8.96703ZM4.49976 14C4.30197 14 4.10863 13.9414 3.94419 13.8315C3.77974 13.7216 3.65156 13.5654 3.57588 13.3827C3.50019 13.2 3.48039 12.9989 3.51897 12.8049C3.55756 12.611 3.6528 12.4328 3.79265 12.2929C3.9325 12.1531 4.11068 12.0578 4.30467 12.0192C4.49865 11.9807 4.69971 12.0005 4.88244 12.0761C5.06517 12.1518 5.22134 12.28 5.33123 12.4445C5.44111 12.6089 5.49976 12.8022 5.49976 13C5.49936 13.2651 5.39387 13.5192 5.20642 13.7067C5.01897 13.8941 4.76485 13.9996 4.49976 14ZM11.4998 14C11.302 14 11.1086 13.9414 10.9442 13.8315C10.7797 13.7216 10.6516 13.5654 10.5759 13.3827C10.5002 13.2 10.4804 12.9989 10.519 12.8049C10.5576 12.611 10.6528 12.4328 10.7926 12.2929C10.9325 12.1531 11.1107 12.0578 11.3047 12.0192C11.4986 11.9807 11.6997 12.0005 11.8824 12.0761C12.0652 12.1518 12.2213 12.28 12.3312 12.4445C12.4411 12.6089 12.4998 12.8022 12.4998 13C12.4994 13.2651 12.3939 13.5192 12.2064 13.7067C12.019 13.8941 11.7649 13.9996 11.4998 14ZM13.9998 12.5H13.4288C13.32 12.0709 13.0712 11.6903 12.7219 11.4184C12.3725 11.1466 11.9424 10.999 11.4998 10.999C11.0571 10.999 10.627 11.1466 10.2776 11.4184C9.92827 11.6903 9.67952 12.0709 9.57076 12.5H6.42876C6.31999 12.0709 6.07124 11.6903 5.72187 11.4184C5.37249 11.1466 4.94244 10.999 4.49976 10.999C4.05707 10.999 3.62702 11.1466 3.27764 11.4184C2.92827 11.6903 2.67952 12.0709 2.57076 12.5H1.99976V9.05353C1.99976 8.75248 2.09036 8.45839 2.25976 8.20953L3.61526 6.21903C3.66109 6.15157 3.72273 6.09634 3.79481 6.05817C3.86688 6.02 3.9472 6.00004 4.02876 6.00003H8.02676C8.09951 6.00004 8.17138 6.01593 8.23736 6.04659C8.30334 6.07724 8.36183 6.12193 8.40876 6.17753L10.1088 8.31152C10.1666 8.3841 10.2434 8.43915 10.3308 8.47053L13.9998 9.78903V12.5ZM12.2773 3.00003C12.2773 2.73481 12.3826 2.48046 12.5701 2.29292C12.7577 2.10538 13.012 2.00003 13.2773 2.00003H14.9998C14.8029 1.65639 14.5078 1.37939 14.1524 1.20456C13.7971 1.02972 13.3976 0.965019 13.0052 1.01874C12.6128 1.07246 12.2454 1.24217 11.9501 1.50608C11.6548 1.77 11.445 2.11611 11.3478 2.50003H7.99976V3.50003H11.3478C11.445 3.88394 11.6548 4.23005 11.9501 4.49397C12.2454 4.75789 12.6128 4.92759 13.0052 4.98131C13.3976 5.03503 13.7971 4.97033 14.1524 4.79549C14.5078 4.62066 14.8029 4.34366 14.9998 4.00003H13.2773C13.012 4.00003 12.7577 3.89467 12.5701 3.70713C12.3826 3.5196 12.2773 3.26524 12.2773 3.00003Z"
                                        fill="#386BF6" />
                                </svg> التقرير</span>

                            <span class="badge d-flex align-items-center gap-2"> <i class="fa fa-user"></i>
                                المزايدات <strong>50</strong> </span>
                            <span class="badge d-flex gap-2 align-items-center"> <svg
                                    xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 16 16"
                                    fill="none">
                                    <path
                                        d="M1.33301 12.6667C1.33301 13.8 2.19967 14.6667 3.33301 14.6667H12.6663C13.7997 14.6667 14.6663 13.8 14.6663 12.6667V7.33337H1.33301V12.6667ZM12.6663 2.66671H11.333V2.00004C11.333 1.60004 11.0663 1.33337 10.6663 1.33337C10.2663 1.33337 9.99967 1.60004 9.99967 2.00004V2.66671H5.99967V2.00004C5.99967 1.60004 5.73301 1.33337 5.33301 1.33337C4.93301 1.33337 4.66634 1.60004 4.66634 2.00004V2.66671H3.33301C2.19967 2.66671 1.33301 3.53337 1.33301 4.66671V6.00004H14.6663V4.66671C14.6663 3.53337 13.7997 2.66671 12.6663 2.66671Z"
                                        fill="#9DB2CE" />
                                </svg> الأسبوع 1 </span>
                        </div>


                        <a href="MazadDetails.html" class="btn mazad-btn w-100 mt-3"> <svg
                                xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20"
                                fill="none">
                                <g clip-path="url(#clip0_246_3877)">
                                    <path
                                        d="M8.85376 17.4163H8.42497V16.4343C8.42497 15.8588 7.95849 15.3921 7.38243 15.3921H2.84716C2.27138 15.3921 1.80458 15.8588 1.80458 16.4343V17.4163H1.37583C0.800361 17.4163 0.333252 17.8831 0.333252 18.4592V19.6233H9.8963V18.4592C9.8963 17.8831 9.42985 17.4163 8.85376 17.4163Z"
                                        fill="white" />
                                    <path
                                        d="M19.7456 13.0472L12.2657 8.01344L12.6625 7.42383C12.9734 6.96176 13.0265 6.40203 12.8547 5.91449C13.5059 5.01988 14.0801 5.6673 14.5246 4.82168C14.9803 3.95437 14.4228 3.15902 12.2733 1.71254C10.1238 0.265975 9.17702 0.0489048 8.54561 0.797772C7.94784 1.50613 8.69765 1.79887 8.21046 2.67367C7.63468 2.64262 7.05733 2.90648 6.7121 3.41941L4.34929 6.93062C4.00784 7.43797 3.97737 8.06305 4.21421 8.58133C3.62491 9.20203 3.10476 8.71203 2.69448 9.4923C2.23901 10.3593 2.79628 11.1546 4.94577 12.6011C7.0953 14.0477 8.04206 14.2644 8.67374 13.5159C9.2621 12.8182 8.54433 12.5245 8.98663 11.6805C9.49831 11.6525 9.99147 11.393 10.2996 10.935L10.7803 10.2211L18.2598 15.2548C18.8694 15.6651 19.6962 15.5033 20.1065 14.8939C20.5167 14.2842 20.355 13.4575 19.7456 13.0472Z"
                                        fill="white" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_246_3877">
                                        <rect width="20" height="20" fill="white" transform="translate(0.333252)" />
                                    </clipPath>
                                </defs>
                            </svg> مزايده </a>
                    </div>
                </div>
            </div>
            <div class="col-md-6 col-xl-3 mb-4" data-aos="fade-right" data-aos-duration="1500">
                <div class="card">
                    <div class="mazad-user-info d-flex flex-wrap align-items-center justify-content-between mb-4">
                        <div class="user-img d-flex align-items-center gap-2 mb-3 flex-wrap">
                            <img src="{{ asset('web/assets/Images/user.png')}}" alt="user img" />
                            <div class="user-info">
                                <h6 class="fw-bold">حسن ابو النصر</h6>
                                <a>مشاهده الملف </a>
                            </div>
                        </div>
                        <span><svg xmlns="http://www.w3.org/2000/svg" width="17" height="16" viewBox="0 0 17 16"
                                fill="none">
                                <path
                                    d="M15.9999 7.99996C15.9999 12.05 12.7167 15.3333 8.66659 15.3333C4.6165 15.3333 1.33325 12.05 1.33325 7.99996C1.33325 3.94987 4.6165 0.666626 8.66659 0.666626C12.7167 0.666626 15.9999 3.94987 15.9999 7.99996ZM2.67114 7.99996C2.67114 11.3112 5.35539 13.9954 8.66659 13.9954C11.9778 13.9954 14.6621 11.3112 14.6621 7.99996C14.6621 4.68877 11.9778 2.00451 8.66659 2.00451C5.35539 2.00451 2.67114 4.68877 2.67114 7.99996Z"
                                    fill="#606060" />
                                <path
                                    d="M8.66642 3.33337C8.29822 3.33337 7.99976 3.63185 7.99976 4.00004V8.31117C7.99976 8.31117 7.99976 8.48497 8.08422 8.61571C8.14076 8.72657 8.22889 8.82291 8.34469 8.88977L11.4246 10.668C11.7434 10.852 12.1512 10.7428 12.3352 10.4239C12.5193 10.105 12.4101 9.69731 12.0912 9.51324L9.33309 7.92084V4.00004C9.33309 3.63185 9.03462 3.33337 8.66642 3.33337Z"
                                    fill="#606060" />
                            </svg> منذ 15 د</span>
                    </div>
                    <div id="carousel2" class="carousel slide" data-bs-ride="carousel">
                        <div class="carousel-indicators">
                            <button type="button" data-bs-target="#carousel2" data-bs-slide-to="0"
                                class="active"></button>
                            <button type="button" data-bs-target="#carousel2" data-bs-slide-to="1"></button>
                            <button type="button" data-bs-target="#carousel2" data-bs-slide-to="2"></button>
                        </div>
                        <div class="carousel-inner">
                            <div class="carousel-item active">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                            <div class="carousel-item">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                            <div class="carousel-item">
                                <img src="{{ asset('web/assets/Images/car.png')}}" class="card-img-top" alt="Car">
                            </div>
                        </div>
                        <button class="carousel-control-prev" type="button" data-bs-target="#carousel2"
                            data-bs-slide="prev">
                            <span class="carousel-control-prev-icon"></span>
                        </button>
                        <button class="carousel-control-next" type="button" data-bs-target="#carousel2"
                            data-bs-slide="next">
                            <span class="carousel-control-next-icon"></span>
                        </button>
                    </div>

                    <!-- Card Body -->
                    <div class="card-body">
                        <div class="car-info d-flex  justify-content-between sidebar-category">
                            <h6 class="card-title">عربية BMW 2024 </h6>
                            <p class="price">2,000,000 جنيه</p>
                        </div>

                        <!-- Auction Details -->
                        <div class="auction-details">
                            <span class="badge d-flex align-items-center gap-2"><svg
                                    xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 16 16"
                                    fill="none">
                                    <path
                                        d="M14.6688 8.96703L10.8028 7.57753L9.18676 5.54853C9.04624 5.37673 8.86924 5.23837 8.66859 5.1435C8.46795 5.04862 8.2487 4.99961 8.02676 5.00003H4.02876C3.78426 5.00003 3.54346 5.0598 3.32734 5.17414C3.11122 5.28847 2.92633 5.4539 2.78876 5.65603L1.43276 7.64753C1.15067 8.06216 0.999804 8.55204 0.999756 9.05353V13C0.999756 13.1326 1.05243 13.2598 1.1462 13.3536C1.23997 13.4473 1.36715 13.5 1.49976 13.5H2.57076C2.67952 13.9291 2.92827 14.3097 3.27764 14.5816C3.62702 14.8535 4.05707 15.0011 4.49976 15.0011C4.94244 15.0011 5.37249 14.8535 5.72187 14.5816C6.07124 14.3097 6.31999 13.9291 6.42876 13.5H9.57076C9.67952 13.9291 9.92827 14.3097 10.2776 14.5816C10.627 14.8535 11.0571 15.0011 11.4998 15.0011C11.9424 15.0011 12.3725 14.8535 12.7219 14.5816C13.0712 14.3097 13.32 13.9291 13.4288 13.5H14.4998C14.6324 13.5 14.7595 13.4473 14.8533 13.3536C14.9471 13.2598 14.9998 13.1326 14.9998 13V9.43753C14.9997 9.33456 14.9679 9.23412 14.9087 9.14991C14.8495 9.0657 14.7657 9.00183 14.6688 8.96703ZM4.49976 14C4.30197 14 4.10863 13.9414 3.94419 13.8315C3.77974 13.7216 3.65156 13.5654 3.57588 13.3827C3.50019 13.2 3.48039 12.9989 3.51897 12.8049C3.55756 12.611 3.6528 12.4328 3.79265 12.2929C3.9325 12.1531 4.11068 12.0578 4.30467 12.0192C4.49865 11.9807 4.69971 12.0005 4.88244 12.0761C5.06517 12.1518 5.22134 12.28 5.33123 12.4445C5.44111 12.6089 5.49976 12.8022 5.49976 13C5.49936 13.2651 5.39387 13.5192 5.20642 13.7067C5.01897 13.8941 4.76485 13.9996 4.49976 14ZM11.4998 14C11.302 14 11.1086 13.9414 10.9442 13.8315C10.7797 13.7216 10.6516 13.5654 10.5759 13.3827C10.5002 13.2 10.4804 12.9989 10.519 12.8049C10.5576 12.611 10.6528 12.4328 10.7926 12.2929C10.9325 12.1531 11.1107 12.0578 11.3047 12.0192C11.4986 11.9807 11.6997 12.0005 11.8824 12.0761C12.0652 12.1518 12.2213 12.28 12.3312 12.4445C12.4411 12.6089 12.4998 12.8022 12.4998 13C12.4994 13.2651 12.3939 13.5192 12.2064 13.7067C12.019 13.8941 11.7649 13.9996 11.4998 14ZM13.9998 12.5H13.4288C13.32 12.0709 13.0712 11.6903 12.7219 11.4184C12.3725 11.1466 11.9424 10.999 11.4998 10.999C11.0571 10.999 10.627 11.1466 10.2776 11.4184C9.92827 11.6903 9.67952 12.0709 9.57076 12.5H6.42876C6.31999 12.0709 6.07124 11.6903 5.72187 11.4184C5.37249 11.1466 4.94244 10.999 4.49976 10.999C4.05707 10.999 3.62702 11.1466 3.27764 11.4184C2.92827 11.6903 2.67952 12.0709 2.57076 12.5H1.99976V9.05353C1.99976 8.75248 2.09036 8.45839 2.25976 8.20953L3.61526 6.21903C3.66109 6.15157 3.72273 6.09634 3.79481 6.05817C3.86688 6.02 3.9472 6.00004 4.02876 6.00003H8.02676C8.09951 6.00004 8.17138 6.01593 8.23736 6.04659C8.30334 6.07724 8.36183 6.12193 8.40876 6.17753L10.1088 8.31152C10.1666 8.3841 10.2434 8.43915 10.3308 8.47053L13.9998 9.78903V12.5ZM12.2773 3.00003C12.2773 2.73481 12.3826 2.48046 12.5701 2.29292C12.7577 2.10538 13.012 2.00003 13.2773 2.00003H14.9998C14.8029 1.65639 14.5078 1.37939 14.1524 1.20456C13.7971 1.02972 13.3976 0.965019 13.0052 1.01874C12.6128 1.07246 12.2454 1.24217 11.9501 1.50608C11.6548 1.77 11.445 2.11611 11.3478 2.50003H7.99976V3.50003H11.3478C11.445 3.88394 11.6548 4.23005 11.9501 4.49397C12.2454 4.75789 12.6128 4.92759 13.0052 4.98131C13.3976 5.03503 13.7971 4.97033 14.1524 4.79549C14.5078 4.62066 14.8029 4.34366 14.9998 4.00003H13.2773C13.012 4.00003 12.7577 3.89467 12.5701 3.70713C12.3826 3.5196 12.2773 3.26524 12.2773 3.00003Z"
                                        fill="#386BF6" />
                                </svg> التقرير</span>

                            <span class="badge d-flex align-items-center gap-2"> <i class="fa fa-user"></i>
                                المزايدات <strong>50</strong> </span>
                            <span class="badge d-flex gap-2 align-items-center"> <svg
                                    xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 16 16"
                                    fill="none">
                                    <path
                                        d="M1.33301 12.6667C1.33301 13.8 2.19967 14.6667 3.33301 14.6667H12.6663C13.7997 14.6667 14.6663 13.8 14.6663 12.6667V7.33337H1.33301V12.6667ZM12.6663 2.66671H11.333V2.00004C11.333 1.60004 11.0663 1.33337 10.6663 1.33337C10.2663 1.33337 9.99967 1.60004 9.99967 2.00004V2.66671H5.99967V2.00004C5.99967 1.60004 5.73301 1.33337 5.33301 1.33337C4.93301 1.33337 4.66634 1.60004 4.66634 2.00004V2.66671H3.33301C2.19967 2.66671 1.33301 3.53337 1.33301 4.66671V6.00004H14.6663V4.66671C14.6663 3.53337 13.7997 2.66671 12.6663 2.66671Z"
                                        fill="#9DB2CE" />
                                </svg> الأسبوع 1 </span>
                        </div>

                        <a href="MazadDetails.html" class="btn mazad-btn w-100 mt-3"> <svg
                                xmlns="http://www.w3.org/2000/svg" width="21" height="20" viewBox="0 0 21 20"
                                fill="none">
                                <g clip-path="url(#clip0_246_3877)">
                                    <path
                                        d="M8.85376 17.4163H8.42497V16.4343C8.42497 15.8588 7.95849 15.3921 7.38243 15.3921H2.84716C2.27138 15.3921 1.80458 15.8588 1.80458 16.4343V17.4163H1.37583C0.800361 17.4163 0.333252 17.8831 0.333252 18.4592V19.6233H9.8963V18.4592C9.8963 17.8831 9.42985 17.4163 8.85376 17.4163Z"
                                        fill="white" />
                                    <path
                                        d="M19.7456 13.0472L12.2657 8.01344L12.6625 7.42383C12.9734 6.96176 13.0265 6.40203 12.8547 5.91449C13.5059 5.01988 14.0801 5.6673 14.5246 4.82168C14.9803 3.95437 14.4228 3.15902 12.2733 1.71254C10.1238 0.265975 9.17702 0.0489048 8.54561 0.797772C7.94784 1.50613 8.69765 1.79887 8.21046 2.67367C7.63468 2.64262 7.05733 2.90648 6.7121 3.41941L4.34929 6.93062C4.00784 7.43797 3.97737 8.06305 4.21421 8.58133C3.62491 9.20203 3.10476 8.71203 2.69448 9.4923C2.23901 10.3593 2.79628 11.1546 4.94577 12.6011C7.0953 14.0477 8.04206 14.2644 8.67374 13.5159C9.2621 12.8182 8.54433 12.5245 8.98663 11.6805C9.49831 11.6525 9.99147 11.393 10.2996 10.935L10.7803 10.2211L18.2598 15.2548C18.8694 15.6651 19.6962 15.5033 20.1065 14.8939C20.5167 14.2842 20.355 13.4575 19.7456 13.0472Z"
                                        fill="white" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_246_3877">
                                        <rect width="20" height="20" fill="white" transform="translate(0.333252)" />
                                    </clipPath>
                                </defs>
                            </svg> مزايده </a>
                    </div>
                </div>
            </div> --}}
                @foreach ($auctions as $auction)
                    <div class="col-md-6 col-xl-4 mb-4">
                        <div class="card">
                            <div class="mazad-user-info d-flex flex-wrap align-items-center justify-content-between mb-4">
                                <div class="user-img d-flex align-items-center gap-2 mb-3 flex-wrap">
                                    <img src="{{ $auction->user->image }}" alt="user img" />
                                    <div class="user-info">
                                        <h6 class="fw-bold">{{ $auction->user->name }}</h6>
                                        <a>{{ __('View Profile') }}</a>
                                    </div>
                                </div>
                                <span><svg xmlns="http://www.w3.org/2000/svg" width="17" height="16"
                                        viewBox="0 0 17 16" fill="none">
                                        <path
                                            d="M15.9999 7.99996C15.9999 12.05 12.7167 15.3333 8.66659 15.3333C4.6165 15.3333 1.33325 12.05 1.33325 7.99996C1.33325 3.94987 4.6165 0.666626 8.66659 0.666626C12.7167 0.666626 15.9999 3.94987 15.9999 7.99996ZM2.67114 7.99996C2.67114 11.3112 5.35539 13.9954 8.66659 13.9954C11.9778 13.9954 14.6621 11.3112 14.6621 7.99996C14.6621 4.68877 11.9778 2.00451 8.66659 2.00451C5.35539 2.00451 2.67114 4.68877 2.67114 7.99996Z"
                                            fill="#606060" />
                                        <path
                                            d="M8.66642 3.33337C8.29822 3.33337 7.99976 3.63185 7.99976 4.00004V8.31117C7.99976 8.31117 7.99976 8.48497 8.08422 8.61571C8.14076 8.72657 8.22889 8.82291 8.34469 8.88977L11.4246 10.668C11.7434 10.852 12.1512 10.7428 12.3352 10.4239C12.5193 10.105 12.4101 9.69731 12.0912 9.51324L9.33309 7.92084V4.00004C9.33309 3.63185 9.03462 3.33337 8.66642 3.33337Z"
                                            fill="#606060" />
                                    </svg> {{ $auction->created_at->diffForHumans() }}</span>
                            </div>
                            <div id="carousel3" class="carousel slide" data-bs-ride="carousel">
                                <div class="carousel-indicators">
                                    <button type="button" data-bs-target="#carousel3" data-bs-slide-to="0"
                                        class="active"></button>
                                    <button type="button" data-bs-target="#carousel3" data-bs-slide-to="1"></button>
                                    <button type="button" data-bs-target="#carousel3" data-bs-slide-to="2"></button>
                                </div>
                                <div class="carousel-inner">
                                    @foreach ($auction->car->carImages as $image)
                                        <div class="carousel-item {{ $loop->first ? 'active' : '' }}">
                                            <img src="{{ $image->image }}" class="card-img-top" alt="Car">
                                        </div>
                                    @endforeach



                                </div>
                                <button class="carousel-control-prev" type="button" data-bs-target="#carousel3"
                                    data-bs-slide="prev">
                                    <span class="carousel-control-prev-icon"></span>
                                </button>
                                <button class="carousel-control-next" type="button" data-bs-target="#carousel3"
                                    data-bs-slide="next">
                                    <span class="carousel-control-next-icon"></span>
                                </button>
                            </div>

                            <!-- Card Body -->
                            <div class="card-body">
                                <div class="car-info d-flex  justify-content-between sidebar-category">
                                    <h6 class="card-title">{{ $auction->car->name }} </h6>
                                    <p class="price">{{ $auction->car->price }}</p>
                                </div>

                                <!-- Auction Details -->
                                <div class="auction-details">
                                    <span class="badge d-flex align-items-center gap-2"><svg
                                            xmlns="http://www.w3.org/2000/svg" width="24" height="24"
                                            viewBox="0 0 16 16" fill="none">
                                            <path
                                                d="M14.6688 8.96703L10.8028 7.57753L9.18676 5.54853C9.04624 5.37673 8.86924 5.23837 8.66859 5.1435C8.46795 5.04862 8.2487 4.99961 8.02676 5.00003H4.02876C3.78426 5.00003 3.54346 5.0598 3.32734 5.17414C3.11122 5.28847 2.92633 5.4539 2.78876 5.65603L1.43276 7.64753C1.15067 8.06216 0.999804 8.55204 0.999756 9.05353V13C0.999756 13.1326 1.05243 13.2598 1.1462 13.3536C1.23997 13.4473 1.36715 13.5 1.49976 13.5H2.57076C2.67952 13.9291 2.92827 14.3097 3.27764 14.5816C3.62702 14.8535 4.05707 15.0011 4.49976 15.0011C4.94244 15.0011 5.37249 14.8535 5.72187 14.5816C6.07124 14.3097 6.31999 13.9291 6.42876 13.5H9.57076C9.67952 13.9291 9.92827 14.3097 10.2776 14.5816C10.627 14.8535 11.0571 15.0011 11.4998 15.0011C11.9424 15.0011 12.3725 14.8535 12.7219 14.5816C13.0712 14.3097 13.32 13.9291 13.4288 13.5H14.4998C14.6324 13.5 14.7595 13.4473 14.8533 13.3536C14.9471 13.2598 14.9998 13.1326 14.9998 13V9.43753C14.9997 9.33456 14.9679 9.23412 14.9087 9.14991C14.8495 9.0657 14.7657 9.00183 14.6688 8.96703ZM4.49976 14C4.30197 14 4.10863 13.9414 3.94419 13.8315C3.77974 13.7216 3.65156 13.5654 3.57588 13.3827C3.50019 13.2 3.48039 12.9989 3.51897 12.8049C3.55756 12.611 3.6528 12.4328 3.79265 12.2929C3.9325 12.1531 4.11068 12.0578 4.30467 12.0192C4.49865 11.9807 4.69971 12.0005 4.88244 12.0761C5.06517 12.1518 5.22134 12.28 5.33123 12.4445C5.44111 12.6089 5.49976 12.8022 5.49976 13C5.49936 13.2651 5.39387 13.5192 5.20642 13.7067C5.01897 13.8941 4.76485 13.9996 4.49976 14ZM11.4998 14C11.302 14 11.1086 13.9414 10.9442 13.8315C10.7797 13.7216 10.6516 13.5654 10.5759 13.3827C10.5002 13.2 10.4804 12.9989 10.519 12.8049C10.5576 12.611 10.6528 12.4328 10.7926 12.2929C10.9325 12.1531 11.1107 12.0578 11.3047 12.0192C11.4986 11.9807 11.6997 12.0005 11.8824 12.0761C12.0652 12.1518 12.2213 12.28 12.3312 12.4445C12.4411 12.6089 12.4998 12.8022 12.4998 13C12.4994 13.2651 12.3939 13.5192 12.2064 13.7067C12.019 13.8941 11.7649 13.9996 11.4998 14ZM13.9998 12.5H13.4288C13.32 12.0709 13.0712 11.6903 12.7219 11.4184C12.3725 11.1466 11.9424 10.999 11.4998 10.999C11.0571 10.999 10.627 11.1466 10.2776 11.4184C9.92827 11.6903 9.67952 12.0709 9.57076 12.5H6.42876C6.31999 12.0709 6.07124 11.6903 5.72187 11.4184C5.37249 11.1466 4.94244 10.999 4.49976 10.999C4.05707 10.999 3.62702 11.1466 3.27764 11.4184C2.92827 11.6903 2.67952 12.0709 2.57076 12.5H1.99976V9.05353C1.99976 8.75248 2.09036 8.45839 2.25976 8.20953L3.61526 6.21903C3.66109 6.15157 3.72273 6.09634 3.79481 6.05817C3.86688 6.02 3.9472 6.00004 4.02876 6.00003H8.02676C8.09951 6.00004 8.17138 6.01593 8.23736 6.04659C8.30334 6.07724 8.36183 6.12193 8.40876 6.17753L10.1088 8.31152C10.1666 8.3841 10.2434 8.43915 10.3308 8.47053L13.9998 9.78903V12.5ZM12.2773 3.00003C12.2773 2.73481 12.3826 2.48046 12.5701 2.29292C12.7577 2.10538 13.012 2.00003 13.2773 2.00003H14.9998C14.8029 1.65639 14.5078 1.37939 14.1524 1.20456C13.7971 1.02972 13.3976 0.965019 13.0052 1.01874C12.6128 1.07246 12.2454 1.24217 11.9501 1.50608C11.6548 1.77 11.445 2.11611 11.3478 2.50003H7.99976V3.50003H11.3478C11.445 3.88394 11.6548 4.23005 11.9501 4.49397C12.2454 4.75789 12.6128 4.92759 13.0052 4.98131C13.3976 5.03503 13.7971 4.97033 14.1524 4.79549C14.5078 4.62066 14.8029 4.34366 14.9998 4.00003H13.2773C13.012 4.00003 12.7577 3.89467 12.5701 3.70713C12.3826 3.5196 12.2773 3.26524 12.2773 3.00003Z"
                                                fill="#386BF6" />
                                        </svg> {{ 'Report' }}</span>

                                    <span class="badge d-flex align-items-center gap-2"> <i class="fa fa-user"></i>
                                        {{ __('Bids') }} <strong>{{ $auction->commitAuctions->count() }}</strong>
                                    </span>
                                    <span class="badge d-flex gap-2 align-items-center"> <svg
                                            xmlns="http://www.w3.org/2000/svg" width="20" height="20"
                                            viewBox="0 0 16 16" fill="none">
                                            <path
                                                d="M1.33301 12.6667C1.33301 13.8 2.19967 14.6667 3.33301 14.6667H12.6663C13.7997 14.6667 14.6663 13.8 14.6663 12.6667V7.33337H1.33301V12.6667ZM12.6663 2.66671H11.333V2.00004C11.333 1.60004 11.0663 1.33337 10.6663 1.33337C10.2663 1.33337 9.99967 1.60004 9.99967 2.00004V2.66671H5.99967V2.00004C5.99967 1.60004 5.73301 1.33337 5.33301 1.33337C4.93301 1.33337 4.66634 1.60004 4.66634 2.00004V2.66671H3.33301C2.19967 2.66671 1.33301 3.53337 1.33301 4.66671V6.00004H14.6663V4.66671C14.6663 3.53337 13.7997 2.66671 12.6663 2.66671Z"
                                                fill="#9DB2CE" />
                                        </svg> {{ __('Week') }}
                                        {{ ceil(\Carbon\Carbon::parse($auction->created_at)->diffInDays(\Carbon\Carbon::now()) / 7) }}
                                    </span>
                                </div>


                                <a href="{{ route('web.aution_details', $auction->id) }}" class="btn mazad-btn w-100 mt-3">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="21" height="20"
                                        viewBox="0 0 21 20" fill="none">
                                        <g clip-path="url(#clip0_246_3877)">
                                            <path
                                                d="M8.85376 17.4163H8.42497V16.4343C8.42497 15.8588 7.95849 15.3921 7.38243 15.3921H2.84716C2.27138 15.3921 1.80458 15.8588 1.80458 16.4343V17.4163H1.37583C0.800361 17.4163 0.333252 17.8831 0.333252 18.4592V19.6233H9.8963V18.4592C9.8963 17.8831 9.42985 17.4163 8.85376 17.4163Z"
                                                fill="white" />
                                            <path
                                                d="M19.7456 13.0472L12.2657 8.01344L12.6625 7.42383C12.9734 6.96176 13.0265 6.40203 12.8547 5.91449C13.5059 5.01988 14.0801 5.6673 14.5246 4.82168C14.9803 3.95437 14.4228 3.15902 12.2733 1.71254C10.1238 0.265975 9.17702 0.0489048 8.54561 0.797772C7.94784 1.50613 8.69765 1.79887 8.21046 2.67367C7.63468 2.64262 7.05733 2.90648 6.7121 3.41941L4.34929 6.93062C4.00784 7.43797 3.97737 8.06305 4.21421 8.58133C3.62491 9.20203 3.10476 8.71203 2.69448 9.4923C2.23901 10.3593 2.79628 11.1546 4.94577 12.6011C7.0953 14.0477 8.04206 14.2644 8.67374 13.5159C9.2621 12.8182 8.54433 12.5245 8.98663 11.6805C9.49831 11.6525 9.99147 11.393 10.2996 10.935L10.7803 10.2211L18.2598 15.2548C18.8694 15.6651 19.6962 15.5033 20.1065 14.8939C20.5167 14.2842 20.355 13.4575 19.7456 13.0472Z"
                                                fill="white" />
                                        </g>
                                        <defs>
                                            <clipPath id="clip0_246_3877">
                                                <rect width="20" height="20" fill="white"
                                                    transform="translate(0.333252)" />
                                            </clipPath>
                                        </defs>
                                    </svg> {{ __('Auction') }}
                                </a>
                            </div>
                        </div>
                    </div>
                @endforeach


            </div>
        </div>


    </section>

    <!---------------------quality section --------------------------->
    <section class="quality d-flex align-items-center flex-wrap mb-5">
        <div class="col-12 col-lg-6 p-5 quality-content">
            <h1 class="main-heading fs-3 fw-bold mb-4">{{ __('Exceptional Quality for Our Clients') }}</h1>
            <ul class="quality-btns nav-tabs d-flex gap-3 mb-3 border-0" id="myTab" role="tablist">
                <li class="nav-link border-0" role="presentation">
                    <a class="active nav-link el-tab" id="profile-tab" data-bs-toggle="tab" href="#profile"
                        role="tab" aria-controls="profile" aria-selected="false">{{ __('Luxury') }}</a>
                </li>
                <li class="nav-link border-0" role="presentation">
                    <a class="nav-link el-tab border-0" id="contact-tab" data-bs-toggle="tab" href="#contact"
                        role="tab" aria-controls="contact" aria-selected="false">{{ __('Comfort') }}</a>
                </li>
            </ul>
            <div class="tab-content" id="myTabContent">
                <div class="tab-pane fade active show" id="profile" role="tabpanel" aria-labelledby="profile-tab">
                    <p>{{ __('We offer you a carefully selected collection of the most luxurious cars in the market. Whether you prefer the sporty appeal of a high-performance sports car, the elegance and luxury of a sleek sedan, or the versatility of a luxurious SUV, we have the perfect car to match your refined taste.') }}
                    </p>
                </div>
                <div class="tab-pane fade" id="contact" role="tabpanel" aria-labelledby="contact-tab">
                    <p>{{ __('We provide you with an innovative and efficient auction service that ensures a smooth and comfortable experience. We know that your comfort is our priority, so we have designed the auction process to be easy and secure. Through the Arabiaty Auction Platform, you can easily engage with auctions, whether you are bidding or listing your car for sale.') }}
                    </p>
                </div>
            </div>
        </div>

        <!-- Right side image -->
        <div class="col-12 col-lg-6">
            <div class="quality-bg">
                <img src="{{ asset('web/assets/Images/qualitybg.png') }}" class="h-100" alt="car-background" />
            </div>
        </div>
    </section>


    <!---------------------discover section --------------------------->
    <section class="discover">
        <h1 class="main-heading text-center fs-3 fw-bold">
            {{ __('Explore the world with a comfortable car') }}

        </h1>
        <p class="text-center main-para">
            {{ __('Enjoy the experience of traveling and discovering the world in an atmosphere of comfort and luxury with your comfortable car') }}
        </p>
        <div class="container py-5">
            <div class="row">
                <div class="col-12 col-lg-4 mb-4">
                    <div class="card text-center border-0   p-3" data-aos="fade-left" data-aos-duration="1000"
                        data-aos-easing="ease-in-out">
                        <div class="card-body">
                            <div class="discover-logo d-flex align-items-center justify-content-center mx-auto mb-3">
                                <svg xmlns="http://www.w3.org/2000/svg" width="43" height="41"
                                    viewBox="0 0 43 41" fill="none">
                                    <path
                                        d="M24.8508 22.5823V22.4934L24.3174 15.3818C24.3026 15.1891 24.2211 15.0225 24.073 14.8817C23.9248 14.741 23.7544 14.6706 23.5618 14.6706H19.4282C19.2355 14.6706 19.0652 14.741 18.917 14.8817C18.7688 15.0225 18.6874 15.1891 18.6725 15.3818L18.1392 22.4934V22.5823C18.1243 22.7601 18.1836 22.9083 18.317 23.0268C18.4503 23.1453 18.6059 23.2046 18.7837 23.2046H24.2063C24.3841 23.2046 24.5397 23.1453 24.673 23.0268C24.8064 22.9083 24.8656 22.7601 24.8508 22.5823ZM41.7188 32.9609C41.7188 34.0425 41.378 34.5833 40.6965 34.5833H25.0508C25.2434 34.5833 25.4064 34.5129 25.5397 34.3721C25.6731 34.2314 25.7323 34.0647 25.7175 33.8721L25.2731 28.1828C25.2582 27.9901 25.1768 27.8235 25.0286 27.6827C24.8804 27.542 24.71 27.4716 24.5174 27.4716H18.4725C18.2799 27.4716 18.1095 27.542 17.9614 27.6827C17.8132 27.8235 17.7317 27.9901 17.7169 28.1828L17.2724 33.8721C17.2576 34.0647 17.3169 34.2314 17.4502 34.3721C17.5836 34.5129 17.7465 34.5833 17.9391 34.5833H2.29348C1.61195 34.5833 1.27118 34.0425 1.27118 32.9609C1.27118 32.1608 1.46379 31.3015 1.849 30.3829L11.1164 7.18111C11.2349 6.89961 11.4275 6.65514 11.6942 6.44772C11.9609 6.2403 12.2424 6.13659 12.5387 6.13659H20.0726C19.88 6.13659 19.7097 6.20696 19.5615 6.34771C19.4133 6.48846 19.3319 6.65514 19.317 6.84775L18.9837 11.1148C18.9689 11.3222 19.0281 11.4926 19.1615 11.6259C19.2948 11.7592 19.4578 11.8259 19.6504 11.8259H23.3396C23.5322 11.8259 23.6952 11.7592 23.8285 11.6259C23.9618 11.4926 24.0211 11.3222 24.0063 11.1148L23.6729 6.84775C23.6581 6.65514 23.5766 6.48846 23.4285 6.34771C23.2803 6.20696 23.1099 6.13659 22.9173 6.13659H30.4512C30.7476 6.13659 31.0291 6.2403 31.2957 6.44772C31.5624 6.65514 31.755 6.89961 31.8736 7.18111L41.141 30.3829C41.5262 31.3015 41.7188 32.1608 41.7188 32.9609Z"
                                        fill="white" />
                                </svg>
                            </div>
                            <h5 class="card-title fw-bold mb-3">{{ __('Full Support and Reliability') }}</h5>
                            <p class="card-text fw-light">
                                {{ __('Reliable support is always available when you need it, ensuring you continue with confidence and peace of mind.') }}
                            </p>
                        </div>
                    </div>
                </div>
                <div class="col-12 col-lg-4 mb-4" data-aos="fade-down" data-aos-duration="1000"
                    data-aos-easing="ease-in-out">
                    <div class="card text-center border-0  p-3">
                        <div class="card-body">
                            <div class="discover-logo d-flex align-items-center justify-content-center mx-auto mb-3">
                                <svg xmlns="http://www.w3.org/2000/svg" width="23" height="41"
                                    viewBox="0 0 23 41" fill="none">
                                    <g clip-path="url(#clip0_1_310)">
                                        <path
                                            d="M8.66125 24.2783C9.57632 24.4997 10.5209 24.6104 11.495 24.6104C12.4691 24.6104 13.4137 24.4997 14.3288 24.2783V38.7792C14.3288 39.1629 14.1885 39.495 13.9081 39.7754C13.6277 40.0558 13.2956 40.196 12.9119 40.196H10.0781C9.69439 40.196 9.36231 40.0558 9.08189 39.7754C8.80147 39.495 8.66125 39.1629 8.66125 38.7792V24.2783ZM3.4808 3.84435C3.4808 3.84435 4.03427 3.29088 5.1412 2.18394C6.24814 1.07701 8.36607 0.523544 11.495 0.523544C14.6239 0.523544 17.2953 1.63048 19.5092 3.84435C21.7231 6.05821 22.83 8.72961 22.83 11.8585C22.83 14.9875 21.7231 17.6589 19.5092 19.8727C17.2953 22.0866 14.6239 23.1935 11.495 23.1935C8.36607 23.1935 5.69467 22.0866 3.4808 19.8727C1.26694 17.6589 0.160004 14.9875 0.160004 11.8585C0.160004 8.72961 1.26694 6.05821 3.4808 3.84435ZM11.495 5.48261C11.7016 5.48261 11.8714 5.41619 12.0042 5.28336C12.137 5.15053 12.2034 4.9808 12.2034 4.77417C12.2034 4.56754 12.137 4.39781 12.0042 4.26498C11.8714 4.13215 11.7016 4.06573 11.495 4.06573C9.34017 4.06573 7.50266 4.82583 5.98247 6.34602C4.46229 7.8662 3.70219 9.70371 3.70219 11.8585C3.70219 12.0652 3.76861 12.2349 3.90144 12.3677C4.03427 12.5006 4.204 12.567 4.41063 12.567C4.61726 12.567 4.78699 12.5006 4.91982 12.3677C5.05265 12.2349 5.11907 12.0652 5.11907 11.8585C5.11907 10.1022 5.74264 8.60047 6.98978 7.35332C8.23693 6.10618 9.73867 5.48261 11.495 5.48261Z"
                                            fill="white" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_1_310">
                                            <rect width="22.67" height="40" fill="white"
                                                transform="matrix(1 0 0 -1 0.160004 40.3599)" />
                                        </clipPath>
                                    </defs>
                                </svg>
                            </div>
                            <h5 class="card-title fw-bold mb-3">{{ __('Free Pickup And Delivery Service') }}</h5>
                            <p class="card-text fw-light">
                                {{ __('Enjoy A Free Pickup And Delivery Service For Your Car With Ease, Ensuring The Highest Standards Of Comfort.') }}
                            </p>

                        </div>
                    </div>
                </div>
                <div class="col-12 col-lg-4 mb-4" data-aos="fade-right" data-aos-duration="1000"
                    data-aos-easing="ease-in-out">
                    <div class="card text-center border-0  p-3">
                        <div class="card-body">
                            <div class="discover-logo d-flex align-items-center justify-content-center mx-auto mb-3">
                                <svg xmlns="http://www.w3.org/2000/svg" width="37" height="41"
                                    viewBox="0 0 37 41" fill="none">
                                    <g clip-path="url(#clip0_1_316)">
                                        <path
                                            d="M10.1901 20.0713C9.09465 17.6731 8.54691 14.927 8.54691 11.833H2.8623V13.9648C2.8623 15.1195 3.56177 16.3186 4.96072 17.5621C6.35967 18.8056 8.1028 19.642 10.1901 20.0713ZM34.1277 13.9648V11.833H28.4431C28.4431 14.927 27.8953 17.6731 26.7999 20.0713C28.8872 19.642 30.6303 18.8056 32.0293 17.5621C33.4282 16.3186 34.1277 15.1195 34.1277 13.9648ZM36.97 11.1225V13.9648C36.97 15.0158 36.6628 16.0743 36.0485 17.1402C35.4341 18.206 34.6051 19.1683 33.5614 20.0269C32.5178 20.8855 31.2373 21.6072 29.7199 22.1919C28.2025 22.7767 26.6074 23.1061 24.9346 23.1801C24.3128 23.9795 23.6097 24.6826 22.8251 25.2896C22.2625 25.7929 21.8739 26.3296 21.6593 26.8995C21.4446 27.4694 21.3373 28.1319 21.3373 28.8869C21.3373 29.6863 21.5631 30.3599 22.0146 30.9076C22.4661 31.4553 23.1878 31.7292 24.1796 31.7292C25.2899 31.7292 26.278 32.066 27.144 32.7396C28.0101 33.4131 28.4431 34.2606 28.4431 35.2821V36.7032C28.4431 36.9105 28.3764 37.0807 28.2432 37.214C28.11 37.3472 27.9397 37.4138 27.7325 37.4138H9.25749C9.05024 37.4138 8.88 37.3472 8.74676 37.214C8.61353 37.0807 8.54691 36.9105 8.54691 36.7032V35.2821C8.54691 34.2606 8.97992 33.4131 9.84594 32.7396C10.712 32.066 11.7001 31.7292 12.8104 31.7292C13.8022 31.7292 14.5239 31.4553 14.9754 30.9076C15.4269 30.3599 15.6527 29.6863 15.6527 28.8869C15.6527 28.1319 15.5454 27.4694 15.3307 26.8995C15.116 26.3296 14.7275 25.7929 14.1649 25.2896C13.3803 24.6826 12.6771 23.9795 12.0554 23.1801C10.3826 23.1061 8.78747 22.7767 7.27009 22.1919C5.75272 21.6072 4.4722 20.8855 3.42854 20.0269C2.38488 19.1683 1.55587 18.206 0.941518 17.1402C0.327166 16.0743 0.019989 15.0158 0.019989 13.9648V11.1225C0.019989 10.5303 0.227241 10.027 0.641744 9.6125C1.05625 9.19799 1.55957 8.99074 2.15172 8.99074H8.54691V6.85901C8.54691 5.88197 8.8948 5.04556 9.59057 4.34978C10.2863 3.65401 11.1228 3.30613 12.0998 3.30613H24.8902C25.8672 3.30613 26.7036 3.65401 27.3994 4.34978C28.0952 5.04556 28.4431 5.88197 28.4431 6.85901V8.99074H34.8383C35.4304 8.99074 35.9337 9.19799 36.3482 9.6125C36.7627 10.027 36.97 10.5303 36.97 11.1225Z"
                                            fill="white" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_1_316">
                                            <rect width="36.95" height="40" fill="white"
                                                transform="matrix(1 0 0 -1 0.019989 40.3599)" />
                                        </clipPath>
                                    </defs>
                                </svg>
                            </div>
                            <h5 class="card-title fw-bold mb-3">{{ __('First-Class Services') }}</h5>
                            <p class="card-text fw-light">
                                {{ __('We Offer You Exceptional Services To Ensure A Unique And Outstanding Car Rental Experience At Every Step.') }}
                            </p>

                        </div>
                    </div>
                </div>

            </div>
        </div>
    </section>



    <!-- =====Agency List section===== -->
    <section class="agency-list-banner">
        <div data-aos="fade-down" data-aos-duration="1000" class="agency-list">
            <div class="slider">
                <div class="slide-track">
                    <div class="slide">
                        <h3>{{ __('Auctions') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Luxury Cars') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Free Delivery') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Reliable Support') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>Bmw</h3>
                    </div>
                    <div class="slide">
                        <h3>Mercedes</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Economy Car Auction') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Buy Cars At Auction') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Fast Technical Support') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Sedan Cars') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>Lamborghini</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Comfortable Travel Experience') }}</h3>
                    </div>
                    <div class="slide">
                        <h3>{{ __('Suv Car') }}</h3>
                    </div>
                </div>

            </div>
        </div>
    </section>


    <!-- Counter Section -->
    <div class="container-fluid counter-section">
        <div class="container">
            <div class="row text-center">
                <div class="col-12 col-md-6 col-lg-3 mb-3" data-aos="fade-left" data-aos-duration="1000">
                    <div class="counter-box">
                        <h2 class="counter" data-target="14911">0</h2>
                        <p class="fw-bold fs-5">{{ __('Successful Auction') }}</p>
                        <span>
                            {{ __('We Strive To Organize Successful Auctions That Exceed Our Clients’ Expectations. Through Careful Planning And Transparent Execution, We Ensure A Unique Experience That Combines Quality And Professionalism.') }}
                        </span>
                    </div>

                </div>
                <div class="col-12 col-md-6 col-lg-3 mb-3" data-aos="fade-down" data-aos-duration="1000">
                    <div class="counter-box">
                        <h2 class="counter" data-target="8585">0</h2>
                        <p class="fw-bold fs-5">{{ __('Satisfied Customers') }}</p>
                        <span>
                            {{ __('We Take Pride In Having A Base Of Satisfied Customers Who Trust Our Services And Return To Us Repeatedly, Thanks To Our Commitment To Providing The Best Deals And An Outstanding Auction Experience.') }}
                        </span>
                    </div>

                </div>
                <div class="col-12 col-md-6 col-lg-3 mb-3" data-aos="fade-up" data-aos-duration="1000">
                    <div class="counter-box">
                        <h2 class="counter" data-target="227">0</h2>
                        <p class="fw-bold fs-5">{{ __('Luxury Cars Sold') }}</p>
                        <span>
                            {{ __('Many Luxury Cars Have Been Sold That Meet The Highest Standards Of Quality And Performance, Whether They Are Sports Cars, Luxury Sedans, Or SUVs.') }}
                        </span>
                    </div>
                </div>

                <div class="col-12 col-md-6 col-lg-3 mb-3" data-aos="fade-right" data-aos-duration="1000">
                    <div class="counter-box">
                        <h2 class="counter" data-target="15">0</h2>
                        <p class="fw-bold fs-5">{{ __('Years Of Experience') }}</p>
                        <span>
                            {{ __('We Take Pride In Over 15 Years Of Experience In The Auction Industry. Throughout These Years, We Have Built A Strong Reputation And Earned High Trust From Our Customers Thanks To Our Specialized And Reliable Services.') }}
                        </span>
                    </div>
                </div>

            </div>
        </div>
    </div>

    <!-- Footer Section -->
    <footer class="footer">
        <div class="container">
           <div class="row justify-content-between ">
                <div class="col-12 col-md-4 mb-3">
                    <h5 class="fw-bold mb-3">{{ __('About Mazad Arbati') }}</h5>
                    <p class="footer-about">
                        {{ $setting->{'description_' . app()->getLocale()} ?? ''  }}
                    </p>
                </div>

                <div class="col-12 col-md-3 mb-3">
                    <h5 class="fw-bold">{{ __('Useful Links') }}</h5>
                    <ul class="list-unstyled my-3">
                        <li class="mb-2"><a href="{{ route('web.home') }}" class="text-white text-decoration-none">{{ __('Home') }}</a></li>
                        <li class="mb-2"><a href="{{ route('web.autions') }}" class="text-white text-decoration-none">{{ __('Auctions') }}</a></li>
                        <li class="mb-2"><a href="{{ route('web.insurance') }}" class="text-white text-decoration-none">{{ __('Insurance') }}</a></li>
                        <li class="mb-2"><a href="{{ route('web.my_commit_autions') }}" class="text-white text-decoration-none">{{ __('Bidding History') }}</a></li>
                    </ul>
                </div>

                <div class="col-12 col-md-3 mb-3">
                    <h5 class="fw-bold">{{ __('Contact Information') }}</h5>
                    <p class="my-3">{{ $setting->country->{'name_' . app()->getLocale()} ?? '' }}</p>
                    <p>{{ $setting->phone ?? '' }}</p>
                    <p>{{ $setting->email ?? '' }}</p>
                </div>
            </div>
            <hr />
            <div class="text-center mt-3">
                <span>
                    {{ __('Designed And Developed By') }}
                    <a href="https://brmja.tech" class="text-decoration-none footer-copyright">
                        {{ __('Brmja Tech') }}
                    </a>
                    {{ __('2025') }}
                </span>
            </div>

        </div>
    </footer>
@endsection
